src/cf/InformationRegisters/СоставыГруппПользователей.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.15">
	<InformationRegister>
		<Properties>
			<Name>СоставыГруппПользователей</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Используется</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>ГруппаПользователей</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ВнешниеПользователи</v8:Type>
						<v8:Type>cfg:CatalogRef.ГруппыВнешнихПользователей</v8:Type>
						<v8:Type>cfg:CatalogRef.ГруппыПользователей</v8:Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Пользователь</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ВнешниеПользователи</v8:Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/cf/InformationRegisters/СоставыГруппПользователей/Ext/RecordSetModule.bsl
///////////////////////////////////////////////////////////////////////////////////////////////////////
// Copyright (c) 2024, ООО 1С-Софт
// Все права защищены. Эта программа и сопроводительные материалы предоставляются 
// в соответствии с условиями лицензии Attribution 4.0 International (CC BY 4.0)
// Текст лицензии доступен по ссылке:
// https://creativecommons.org/licenses/by/4.0/legalcode
///////////////////////////////////////////////////////////////////////////////////////////////////////

#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОписаниеПеременных

Перем СтарыеЗаписи; // Заполняется ПередЗаписью для использования ПриЗаписи.

#КонецОбласти

#Область ОбработчикиСобытий

Процедура ПередЗаписью(Отказ, Замещение)
	
	// АПК:75-выкл проверка ОбменДанными.Загрузка должна быть после записи изменений в журнал.
	Если ПользователиСлужебныйПовтИсп.РегистрироватьИзмененияПравДоступа() Тогда
		ПодготовитьЗаписьИзмененийВЖурналРегистрации(ЭтотОбъект, Замещение, СтарыеЗаписи);
	КонецЕсли;
	// АПК:75-вкл
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
КонецПроцедуры

Процедура ПриЗаписи(Отказ, Замещение)
	
	// АПК:75-выкл проверка ОбменДанными.Загрузка должна быть после записи изменений в журнал.
	Если ПользователиСлужебныйПовтИсп.РегистрироватьИзмененияПравДоступа() Тогда
		ЗаписатьИзмененияВЖурналРегистрации(ЭтотОбъект, Замещение, СтарыеЗаписи);
	КонецЕсли;
	// АПК:75-вкл
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Процедура ПодготовитьЗаписьИзмененийВЖурналРегистрации(Объект, Замещение, СтарыеЗаписи)
	
	Если Объект.ДополнительныеСвойства.Свойство("ЭтоСтандартноеОбновлениеРегистра") Тогда
		Возврат;
	КонецЕсли;
	
	НаборЗаписей = РегистрыСведений.СоставыГруппПользователей.СоздатьНаборЗаписей();
	
	Если Замещение Тогда
		Для Каждого ЭлементОтбора Из Отбор Цикл
			Если ЭлементОтбора.Использование Тогда
				НаборЗаписей.Отбор[ЭлементОтбора.Имя].Установить(ЭлементОтбора.Значение);
			КонецЕсли;
		КонецЦикла;
		НаборЗаписей.Прочитать();
	КонецЕсли;
	
	СтарыеЗаписи = НаборЗаписей.Выгрузить();
	
КонецПроцедуры

Процедура ЗаписатьИзмененияВЖурналРегистрации(Объект, Замещение, СтарыеЗаписи)
	
	Если Объект.ДополнительныеСвойства.Свойство("ЭтоСтандартноеОбновлениеРегистра") Тогда
		Возврат;
	КонецЕсли;
	
	Таблица = Выгрузить();
	Таблица.Колонки.Добавить("ВидИзменения", Новый ОписаниеТипов("Строка"));
	Таблица.ЗаполнитьЗначения("Добавлено", "ВидИзменения");
	ОтборСтрок = Новый Структура("ГруппаПользователей, Пользователь");
	
	Если ЗначениеЗаполнено(СтарыеЗаписи) Тогда
		Индекс = Таблица.Количество();
		Пока Индекс > 0 Цикл
			Индекс = Индекс - 1;
			НоваяЗапись = Таблица.Получить(Индекс);
			ЗаполнитьЗначенияСвойств(ОтборСтрок, НоваяЗапись);
			НайденныеСтроки = СтарыеЗаписи.НайтиСтроки(ОтборСтрок);
			СтараяЗапись = ?(НайденныеСтроки.Количество() = 0, Неопределено, НайденныеСтроки[0]);
			Если СтараяЗапись = Неопределено Тогда
				Продолжить;
			КонецЕсли;
			Если НоваяЗапись.Используется = СтараяЗапись.Используется Тогда
				Таблица.Удалить(НоваяЗапись);
			Иначе
				НоваяЗапись.ВидИзменения = "Изменено";
			КонецЕсли;
			СтарыеЗаписи.Удалить(СтараяЗапись);
		КонецЦикла;
		Для Каждого СтараяЗапись Из СтарыеЗаписи Цикл
			НоваяСтрока = Таблица.Добавить();
			ЗаполнитьЗначенияСвойств(НоваяСтрока, СтараяЗапись);
			НоваяСтрока.ВидИзменения = "Удалено";
		КонецЦикла;
	КонецЕсли;
	
	Если Таблица.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;
	
	ПользователиСлужебный.ЗарегистрироватьИзмененияСоставовГрупп(Таблица);
	
КонецПроцедуры

#КонецОбласти

#Иначе
ВызватьИсключение НСтр("ru = 'Недопустимый вызов объекта на клиенте.'");
#КонецЕсли
